## Dataframe using list

In [1]:
import pandas as pd
names=['Avinash','Ayush','Akash']
pd.DataFrame(names)

         0
0  Avinash
1    Ayush
2    Akash

In [2]:
age=[23,34,65]
city=['Nashik','pune','Nagpur']
pd.DataFrame(names,age)

          0
23  Avinash
34    Ayush
65    Akash

In [3]:
pd.DataFrame(zip(names,age))

         0   1
0  Avinash  23
1    Ayush  34
2    Akash  65

In [4]:
pd.DataFrame(zip(names,age),city)

              0   1
Nashik  Avinash  23
pune      Ayush  34
Nagpur    Akash  65

In [5]:
pd.DataFrame(zip(names,age),['A','B','C'])

         0   1
A  Avinash  23
B    Ayush  34
C    Akash  65

In [6]:
ix=['A','B','C']
pd.DataFrame(zip(names,age),index=ix,columns=['Name','Age'])

      Name  Age
A  Avinash   23
B    Ayush   34
C    Akash   65

In [7]:
Names=['priti','om','suyog']
age=[23,34,35]
city=['Nashik','pune','Mumbai']
data=zip(Names,age,city)
col=['Names','Age','City']
df=pd.DataFrame(data,index=ix,columns=col)

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
df['Names']

A    priti
B       om
C    suyog
Name: Names, dtype: object

In [10]:
df['Age']

A    23
B    34
C    35
Name: Age, dtype: int64

In [11]:
job=['Ds','DE','DA']
df['Job']=job

In [12]:
df

   Names  Age    City Job
A  priti   23  Nashik  Ds
B     om   34    pune  DE
C  suyog   35  Mumbai  DA

In [13]:
df['Age']=[78,59,60]

In [14]:
df

   Names  Age    City Job
A  priti   78  Nashik  Ds
B     om   59    pune  DE
C  suyog   60  Mumbai  DA

In [15]:
df.shape

(3, 4)

In [16]:
print(f'no of rows are {df.shape[0]} and no of columns are {df.shape[1]}')

no of rows are 3 and no of columns are 4

In [17]:
df.drop('A',axis=0,inplace=True)

In [18]:
df

   Names  Age    City Job
B     om   59    pune  DE
C  suyog   60  Mumbai  DA

In [19]:
df1=df.drop('City',axis=1)

In [20]:
df

   Names  Age    City Job
B     om   59    pune  DE
C  suyog   60  Mumbai  DA

In [21]:
df1

   Names  Age Job
B     om   59  DE
C  suyog   60  DA

In [34]:
Name=['A','B','C','D']
Age=[12,23,34,56]
City=['pune','mum','nashik','T']
df=pd.DataFrame(zip(Name,Age,City),columns=['Names','Age','City'])

In [23]:
df.drop('Age',axis=1,inplace=True)

In [24]:
df

  Names    City
0     A    pune
1     B     mum
2     C  nashik
3     D       T

In [26]:
df.drop(['City'],axis=1,inplace=True)

In [27]:
df

  Names
0     A
1     B
2     C
3     D

In [28]:
df

  Names
0     A
1     B
2     C
3     D

In [29]:
df.drop(0,axis=0,inplace=True)

In [30]:
df

  Names
1     B
2     C
3     D

In [35]:
df.to_csv('data.csv',index=False)

In [36]:
pd.read_csv('data.csv')

  Names  Age    City
0     A   12    pune
1     B   23     mum
2     C   34  nashik
3     D   56       T

In [42]:
df

  Names  Age    City
0     A   12    pune
1     B   23     mum
2     C   34  nashik
3     D   56       T

In [ ]:
df.to_